# 1. Реализовать скрипт, в котором должна быть предусмотрена функция расчёта заработной платы сотрудника.
# Используйте в нём формулу: (выработка в часах*ставка в час) + премия.
# Во время выполнения расчёта для конкретных значений необходимо запускать скрипт с параметрами.

from sys import argv

data = ['file name', 'выработка в часах', 'ставка в час', 'премия']
# словарь params с ключами из листа data и значениями параметров из скрипта
params = {el: el_value for el, el_value in zip(data, argv)}
# удаляем первый элемент словаря (это название модуля)
params.pop(data[0])
for key, key_val in params.items():
    print(f'{key}: {key_val}')

try:
    salary = float(params['выработка в часах']) * float(params['ставка в час']) + float(params['премия'])
    if float(params['выработка в часах']) < 0 or float(params['ставка в час']) <= 0 or float(params['премия']) < 0:
        raise TypeError
    print(f'Заработная плата сотрудника составляет: {salary}')
except ValueError:
    print('Введены нечисловые значение. Повторите ввод')
except TypeError:
    print('Ошибка. Значения должны быть положительными')
