# 1. Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
# Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.

def my_divide(arg_1, arg_2):
    '''Возвращает частное от деления. При делении на 0 или при нечисловых типах аргументов возвращает None.

    :param arg_1: - делимое
    :param arg_2: - делитель
    :return: - частное

    '''
    try:
        return float(arg_1) / float(arg_2)
    except ZeroDivisionError:
        print('Ошибка. На ноль делить нельзя')
        return
    except ValueError:
        print('Ошибка. Необходимо ввести числа')
        return


a = input('Введите первое число: ')
b = input('Введите второе число: ')
res = my_divide(a, b)
if res is not None:
    print(f'результат: {res:.2f}')
