str_var = 'hello'  # строка
int_var = 4  # целое число
float_var = 5.55454  # переменная с плавающей точкой
print(f'{float_var}')  # простой вывод на экран
print(f'{float_var:.2f}')  # вывод на экран числа с 2-мя знаками после запятой
print(f'{int_var:03d}')  # доведение до количества разрядов 3
print(f'{int_var} + {float_var:.2f} = {int_var+float_var:.2f}')  # вывод на экран сообщения со значениями переменных
input_text = input('введите текст: ')  # запись в переменную текста от пользователя
print(input_text, type(input_text))  # вывод на экран текста от пользователя и тип переменной (строка)
input_number = float(input('введите число: '))  # запись в переменную числа с плавающей точкой от пользователя
print(type(input_number))  # вывод на экран тип переменной (float)
print(f'это число в квадрате = {input_number ** 2:.2f}')  # вывод на экран сообщения с возведением в степень переменной
