# 1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

my_list = [12, 3.14, '15', 'hello', True, (3+4j), -6, ('a', 1), ['b', False], {1: 'hi', 2: 'goodbye'}]
for element in my_list:
    print(type(element))
