# 2. Для списка реализовать обмен значений соседних элементов,
# т.е. Значениями обмениваются элементы с индексами 0 и 1, 2 и 3 и т.д.
# При нечетном количестве элементов последний сохранить на своем месте.
# Для заполнения списка элементов необходимо использовать функцию input().

input_data = input('Введите элементы списка через пробел: ')
# создаем список, разделяя по пробелам введенный пользователем текст на элементы:
my_list = list(input_data.split(' '))
print(my_list)

# создаем цикл, чтобы пройтись по каждому 2-му элементу списка.
# меняем местами соседние элементы списка
# если количество элементов списка нечетное, последний элемент останется неизменным, т.к. не попадет в этот цикл
for element in range(1, len(my_list), 2):
    my_list[element], my_list[element - 1] = my_list[element - 1], my_list[element]

print(my_list)
