# просим пользователя ввести время в секундах и записываем в переменную seconds
# также переводим введенное значение из формата строки в целочисленный формат
# проверяем, что пользователь ввел положительное целое число, а не другие символы.
# Выход из цикла, когда пользователь корректно ввел число
while True:
    try:
        seconds = int(input('Пожалуйста, введите время в секундах: '))
        if seconds < 0:
            print("время не может быть отрицательным. Пожалуйста, повторите ввод.")
            continue
        break
    except ValueError:
        print("Это не целочисленное значение. Пожалуйста, повторите ввод.")

# сначала переведем секунды в часы. для этого нужно разделить секунды на 3600 без остатка
# 3600 - это 60 умноженное на 60: 60 сек в минуте и 60 минут в часе
hours = seconds // 3600
residual_seconds = seconds % 3600  # оставшиеся секунды, составляющие менее 1 часа

# переведем оставшиеся секунды в минуты. для этого нужно разделить оставшиеся секунды на 60 без остатка
minutes = residual_seconds // 60

# оставшиеся секунды останутся секундами, т.к. они составляют менее 1 минуты
residual_seconds = residual_seconds % 60

# вывод на экран в формате чч:мм:сс
print(f'время в формате чч:мм:сс: {hours:02d}:{minutes:02d}:{residual_seconds:02d}')
