# 3. Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.

# создаем цикл для проверки правильности введенного пользователем значения
# значение должно быть целым числом от 1 до 12
error_msg = 'Некорректный ввод.'
while True:
    try:
        month_num = int(input('Введите месяц в виде целого числа от 1 до 12: '))
        if month_num - 1 in range(12):
            break
        else:
            print(error_msg)
            continue
    except ValueError:
        print(error_msg)

# нумерация месяцев от 1 до 4. 1 - это зима, 4 - это осень:
season_num = 1 if month_num == 12 else month_num // 3 + 1

# Решение через dict
dict_seasons = {
    1: 'Зима',
    2: 'Весна',
    3: 'Лето',
    4: 'Осень'}

dict_months = {
    1: 'Январь',
    2: 'Февраль',
    3: 'Март',
    4: 'Апрель',
    5: 'Май',
    6: 'Июнь',
    7: 'Июль',
    8: 'Август',
    9: 'Сентябрь',
    10: 'Октябрь',
    11: 'Ноябрь',
    12: 'Декабрь'}

print(f'месяц: {dict_months[month_num]}')
print(f'сезон: {dict_seasons[season_num]}')

# Решение через list
list_seasons = ['Зима', 'Весна', 'Лето', 'Осень']
list_months = ['Январь', 'Февраль', 'Март', 'Апрель', 'Май', 'Июнь',
               'Июль', 'Август', 'Сентябрь', 'Октябрь', 'Ноябрь', 'Декабрь']

print(f'месяц: {list_months[month_num-1]}')
print(f'сезон: {list_seasons[season_num-1]}')
