# просим пользователя ввести число n и записываем в переменную number
# проверяем, что пользователь ввел неотрицательное целочисленное значение, а не другие символы.
# Выход из цикла, когда пользователь корректно ввел число
while True:
    try:
        number = input('Пожалуйста, введите число n: ')
        int(number)
        if int(number) < 0:
            print("n не может быть отрицательным. Пожалуйста, повторите ввод.")
            continue
        break
    except ValueError:
        print("Это не целочисленное значение. Пожалуйста, повторите ввод.")

# создаем рабочие переменные
sum_amount = 0  # для суммирования промежуточного результата
i = 0  # счетчик для цикла
result_text = ""  # для вывода конечного сообщения (для n=2 конечное сообщение будет "2 + 22 = 24")
number_i = ""  # число, которое необходимо прибавить на шаге i в цикле (для n=3 на втором шаге number_i = 33)

while i < int(number):
    i += 1
    number_i += number  # формат строки. на каждом шаге происходит конкантинация
    result_text += ' + ' + number_i
    sum_amount += int(number_i)

print(f'{result_text[3:]} = {sum_amount}')
