# 4. Пользователь вводит строку из нескольких слов, разделённых пробелами.
# Вывести каждое слово с новой строки. Строки необходимо пронумеровать.
# Если в слово длинное, выводить только первые 10 букв в слове.

input_data = input('Введите нескольких слов через пробел: ')
# создаем список, разделяя по пробелам введенный пользователем текст на элементы:
my_list = list(input_data.split(' '))

for i, word in enumerate(my_list):
    # если слово длиннее 10 символов, то выводим только 10 символов слова
    word = word[:10] if len(word) > 10 else word
    print(f'{i+1}: {word}')
