# 5. Программа запрашивает у пользователя строку чисел, разделенных пробелом.
# При нажатии Enter должна выводиться сумма чисел.
# Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter.
# Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме.
# Но если вместо числа вводится специальный символ, выполнение программы завершается.
# Если специальный символ введен после нескольких чисел, то вначале нужно добавить сумму этих чисел
# к полученной ранее сумме и после этого завершить программу.

def sum_numbers(numbers, spec_sign):
    '''Возвращает сумму полученных чисел, пока на входе не получили специальный символ

    :param numbers: числа для суммирования
    :param spec_sign: специальный символ
    res - переменная, которая аккумулирует сумму полученных чисел
    is_end - булевая переменная, которая принимает значение True, если был получен спец символ
    :return: возвращает сумму полученных чисел, и булевую переменную is_end
    '''
    is_end = False
    res = 0
    for number in numbers:
        if number == spec_sign:
            is_end = True
            return res, is_end
        else:
            try:
                res += float(number)
            except ValueError:
                pass
    return res, is_end


result = '0'
spec_sign = '*'
while True:
    input_data = input('Введите числа через пробел: ').split(' ')
    input_data.insert(0, str(result))  # добавляем промежуточную сумму в список к введенным числам
    result, is_end = sum_numbers(input_data, spec_sign)
    print(result)
    if is_end:
        print('Конец')
        break
