# 5. Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
# У пользователя необходимо запрашивать новый элемент рейтинга.
# Если в рейтинге существуют элементы с одинаковыми значениями,
# то новый элемент с тем же значением должен разместиться после них.

my_list = [7, 5, 3, 3, 2]
print(f'набор натуральных чисел: {my_list}')

# создаем цикл для проверки правильности введенного пользователем значения
# значение должно быть натуральным числом
error_msg = 'Некорректный ввод. Вам нужно ввести натуральное число'
while True:
    try:
        input_number = int(input('Введите новый элемент рейтинга: '))
        if input_number >= 0:
            break
        else:
            print(error_msg)
            continue
    except ValueError:
        print(error_msg)

# создаем цикл, в котором идем от последнего элемента списка к первому
i = len(my_list)
while i >= 0:
    i -= 1
    # сравниваем поэлементно с введенным числом
    if input_number <= my_list[i]:
        # если введенное число не больше денного элемента,
        # то добавляем введенное число в список на позицию i+1 (т.е. после данного элемента)
        my_list.insert(i+1, input_number)
        break
else:
    # если условие не было выполнено, то введенное значение самое большое в списке
    # поэтому добавляем его на 0-ю позицию в списке
    my_list.insert(0, input_number)

print(f'результат: {my_list}')
