# 6. Реализовать два небольших скрипта:
# итератор, генерирующий целые числа, начиная с указанного;
# итератор, повторяющий элементы некоторого списка, определённого заранее.
# Подсказка: используйте функцию count() и cycle() модуля itertools.
# Обратите внимание, что создаваемый цикл не должен быть бесконечным. Предусмотрите условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3. При достижении числа 10 — завершаем цикл.
# Вторым пунктом необходимо предусмотреть условие, при котором повторение элементов списка прекратится.

from itertools import cycle, count
# итератор, генерирующий целые числа, начиная с указанного
try:
    c = int(input('ведите целое число: '))
    for el in count(c):
        if el > max(c+5, 10):
            break
        else:
            print(el)
except ValueError:
    print('Ошибка. Это не целое число. Повторите ввод')

# итератор, повторяющий элементы некоторого списка, определённого заранее.
my_list = ['a', 'b', 'c', 'd', 'e']
my_iter = cycle(my_list)

i = 0
for el in my_iter:
    if i < 8:
        print(el)
        i += 1
    else:
        break
