# Сформировать (не программно) текстовый файл. В нём каждая строка должна описывать
# учебный предмет и наличие лекционных, практических и лабораторных занятий по предмету.
# Сюда должно входить и количество занятий. Необязательно, чтобы для каждого предмета были все типы занятий.
# Сформировать словарь, содержащий название предмета и общее количество занятий по нему. Вывести его на экран.
# Примеры строк файла: Информатика: 100(л) 50(пр) 20(лаб).
# Физика: 30(л) — 10(лаб)
# Физкультура: — 30(пр) —
# Пример словаря: {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}

try:
    with open('hw_5_6.txt', encoding='utf-8') as f_obj:
        dict_subject = {}
        subject_list = [line.split() for line in f_obj]
        for row in subject_list:  # цикл по каждой строке
            subj_hours = 0
            for el_num in range(1, len(row)):  # цикл по каждому элементу в строке, кроме названия предмета
                # переводим часы в числовое значение, убирая все нечисловые символы
                row[el_num] = ''.join(char for char in row[el_num] if char.isdigit())
                # если часы не заполнены, то заменяем на 0
                row[el_num] = int(row[el_num]) if row[el_num] != '' else 0
                subj_hours += row[el_num]
            dict_subject.update({row[0]: subj_hours})
        print(dict_subject)

except IOError:
    print("Произошла ошибка чтения файла!")
