# 7. Реализовать генератор с помощью функции с ключевым словом yield, создающим очередное значение.
# При вызове функции должен создаваться объект-генератор. Функция вызывается следующим образом: for el in fact(n).
# Она отвечает за получение факториала числа. В цикле нужно выводить только первые n чисел, начиная с 1! и до n!.
# Подсказка: факториал числа n — произведение чисел от 1 до n. Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.
from itertools import count


def gen():
    num = 1
    res = 1
    for _ in count(1):
        res *= num
        num += 1
        yield res


error_msg = 'Ошибка. Некорректный ввод.'
try:
    n = int(input('Введите положительное число: '))
    if n <= 0:
        print(error_msg)
    i = 0
    for el in gen():
        if i < n:
            print(f'{i+1}! = {el}')
            i += 1
        else:
            break
except ValueError:
    print(error_msg)
